-- Лабораторна робота №1
-- студента групи КН-31 підгрупа 1
-- Варіант 9

-- Завдання 1
-- Наведiть приклади виразiв вказаного типу. Кожен список має мiстити кiлька елементiв. 
-- Перегляньте тип прикладiв, як їх визначає ghci. Про-коментуйте.

-- Приклад [(Double,(Bool,Char),Integer)]:
-- [(1.2, (True, 'k'), 10), (3.14, (False, 'y'), 20)]

-- Переглянути тіп можна наступною командою
-- :type [(1.2, (True, 'k'), 10), (3.14, (False, 'y'), 20)]

-- В результаті дістанемо:
-- [(1.2, (True, 'k'), 10), (3.14, (False, 'y'), 20)]
  -- :: (Fractional a, Num c) => [(a, (Bool, Char), c)]

-- Завдання 2
-- Визначте два варiанти вказаних далi функцiй. 
-- Перший варiант – з одним аргументом-кортежем, 
-- другий – без використання кортежiв чи спискiв

-- Функцiя визначає, чи перетинаються два кола. Кожне коло задається координатами центра та радiусом.
distance (x1 , y1) (x2 , y2) = sqrt ((x1 - x2)*(x1 - x2) + (y1 - y2)*(y1 - y2))

f1 :: (Float, Float, Float, Float, Float, Float) -> Bool
f1 (x1, y1, x2, y2, r1, r2) = (r1 - r2) <= (distance (x1,y1) (x2,y2)) && distance (x1,y1) (x2,y2) <= (r1 + r2)

f2 :: Float -> Float -> Float -> Float -> Float -> Float -> Bool
f2 x1 y1 x2 y2 r1 r2 = (r1 - r2) <= (distance (x1,y1) (x2,y2)) && distance (x1,y1) (x2,y2) <= (r1 + r2)