-- Лабораторна робота №2
-- студента групи КН-31 підгрупа 1
-- Варіант 9

-- Завдання 1
-- Видалити повтори елементiв списку (список - множина)
rmDup :: [Integer] -> [Integer]
rmDup [] = []

-- Рекурсивна функція складається з лямда виразу який викориростивує 
-- предикатну функцію filter
-- Filter - повертає список, створений з членів списку (другий аргумент), що відповідають умові, заданий першим аргументом
rmDup (x:xs) = x : rmDup (filter (\y -> not(x == y)) xs)

-- Приклад:
-- Команда:  rmDup [1,1,1,5,5,3,1,1,222,222,222,222]
-- В результаті дістанемо:
-- [1,5,3,222]

-- Завдання 2
-- Знайти найменше спiльне кратне двох чисел.
-- Функція використовує алгоритм евкліда.
euclid :: (Float,Float) -> Float
euclid(n,m) =
  if n == m then n
  else if n < m then euclid(n, m-n)
    else euclid(n-m, m)

-- Приклад:
-- Команда: euclid (42, 24)
-- В результаті дістанемо:
-- 6.0